Revit 2026 API

# ExporterIFCGetLevelInfos Method

---

**Note: This API is now obsolete.**

Returns a collection containing the information about all levels in the document.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
public IDictionary<ElementId, IFCLevelInfo> GetLevelInfos()
```
```vb
<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>
Public Function GetLevelInfos As IDictionary(Of ElementId, IFCLevelInfo)
```
```cpp
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
IDictionary<ElementId^, IFCLevelInfo^>^ GetLevelInfos()
```
```fsharp
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>]
member GetLevelInfos : unit -> IDictionary<ElementId, IFCLevelInfo>
```

#### Return Value

IDictionaryElementId, IFCLevelInfo The collection of level information.

Level information is currently automatically collected and cached in the ExporterIFC object. This method returns the cached information which is often needed during export of particular building elements which reference levels, as well as to implement automatic wall and column splitting.

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace